# Homework 4 Solutions: Data Aggregation and Cleaning
## ECE204 Data Science & Engineering

### Please refer to Homework 4 in Canvas for the prompts for each question

In [1]:
import pandas as pd

---
**Problem 1.**

In [2]:
df_cars = pd.read_csv("cars.csv")
df_cars.head(10)

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01
5,10.0,8,429.0,198.0,15.0,ford galaxie 500,USA,4341,1970-01-01
6,9.0,8,454.0,220.0,14.0,chevrolet impala,USA,4354,1970-01-01
7,8.5,8,440.0,215.0,14.0,plymouth fury iii,USA,4312,1970-01-01
8,10.0,8,455.0,225.0,14.0,pontiac catalina,USA,4425,1970-01-01
9,8.5,8,390.0,190.0,15.0,amc ambassador dpl,USA,3850,1970-01-01

1.) What is the mean Displacement of the cars that do not have a null/NaN value in Horsepower or Miles_per_Gallon columns in the dataset cars.csv?

NOTE: Report your result rounded to 2 places after the decimal.

In [3]:
filtered_df = df_cars[df_cars['Miles_per_Gallon'].notna() & df_cars['Horsepower'].notna()]
displace_df = filtered_df['Displacement'].mean()
round(displace_df, 2)

194.41

---
**Problem 2.**

In [4]:
df_cars = pd.read_csv("cars.csv")
df_cars.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01

2.) In the dataset cars.csv, find the cars with the highest fuel economy (Miles_per_Gallon) for each unique country of Origin. What is the median fuel economy of these 3 cars?

NOTE: Report your result rounded to 2 places after the decimal.

In [5]:
highest_mpg_cars = df_cars.loc[df_cars.groupby('Origin')['Miles_per_Gallon'].idxmax()]
median_mpg = round(highest_mpg_cars['Miles_per_Gallon'].median(), 2)
median_mpg

44.3

---
**Problem 3.**

In [6]:
df_cars = pd.read_csv("cars.csv")

3.) From each country/origin, find the car that has the highest Horsepower. What is the mean weight (in lbs) of these cars?

Hint:  aggfunc='idxmax'

NOTE: Report your result rounded to 2 places after the decimal.

In [7]:
cars_pivot = pd.pivot_table(df_cars, index='Origin', values='Horsepower', aggfunc='idxmax', fill_value=0)
highest_hp = df_cars.loc[cars_pivot['Horsepower']]
mean_weight = round(highest_hp['Weight_in_lbs'].mean(), 2)
mean_weight

3532.67

---
**Problem 4.**

In [8]:
df_cars = pd.read_csv("cars.csv")
df_cars.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01

4.) In cars.csv, for each unique value of Cylinders, find the length of the longest Name among the cars having that many Cylinders. What is the average length of Name of the 5 such lengths you will find?

NOTE: Report your result rounded to 2 places after the decimal.

In [9]:
df_cars['Name_length'] = df_cars['Name'].apply(len)
max_name = df_cars.groupby('Cylinders')['Name_length'].max()
avg_length = max_name.mean()
round(avg_length, 2)

26.8

---
**Problem 5.**

In [10]:
import numpy as np

5.) Generate 100,000 random numbers using a normal distribution with mean 3.03 and standard deviation 2.97. What proportion of these numbers is greater than 0.67? 

NOTE: Your answer should be between 0 and 1. Report your result rounded to 2 places after the decimal.

In [11]:
numbers = np.random.normal(loc=3.03, scale=2.97, size=100000)
proportion = round((np.mean(numbers > 0.67)), 2)
proportion

0.79

---
**Problem 6.**

In [12]:
df_cars_unclean = pd.read_csv("cars_unclean.csv")
df_cars_unclean.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,14.5,4.0,90.0,75.0,28.0,dodge colt,USA,2125,1/1/1974
1,22.1,NaN,NaN,60.0,24.5,NaN,USA,2164,NaN
2,17.0,6.0,262.0,85.0,38.0,oldsmobile cutlass ciera (diesel),USA,3015,1/1/1982
3,16.4,4.0,86.0,65.0,37.2,datsun 310,Japan,2019,1/1/1980
4,14.5,4.0,156.0,92.0,26.0,chrysler lebaron medallion,USA,2585,1/1/1982

6.) Let's find the mean Miles_per_Gallon of cars from cars_unclean.csv. Unfortunately, the cars dataset has been corrupted and contains missing values. It is your job to present a dataset that contains:

Only the ['Acceleration', 'Cylinders', 'Displacement', 'Horsepower', 'Miles_per_Gallon', 'Weight_in_lbs'] variables (Drop all other columns)
Remove all rows with nulls/NaNs
What is the mean Miles_per_Gallon of the cars in the clean dataset?

NOTE: Report your result rounded to 2 places after the decimal.

In [13]:
drop_car = df_cars_unclean.drop(columns=['Name', 'Origin', 'Year'])
clean_df = drop_car.dropna()
mean_mpg = clean_df['Miles_per_Gallon'].mean()
round(mean_mpg, 2)

23.49

---
**Problem 7.**

In [14]:
df_airports = pd.read_csv("airports_unclean.csv")
df_airports

,iata,name,city,state,country,latitude,longitude
0,X67,Christiansted Harbor Seaplane Base,Christiansted,VI,USA,17.747195,-64.704864
1,STX,Henry E. Rohlsen,Christiansted,VI,USA,17.701889,-64.798556
2,X96,Cruz Bay Harbor Seaplane Base,Cruz Bay,VI,USA,18.336898,-64.799583
3,X66,Charlotte Amalie Harbor Seaplane Base,Charlotte Amalie,VI,USA,18.338567,-64.940701
4,STT,Cyril E. King,Charlotte Amalie,VI,USA,18.337306,-64.973361
...,...,...,...,...,...,...,...
3359,SVA,Savoonga,Savoonga,AK,USA,63.686394,-170.492636
3360,PPG,Pago Pago International,Pago Pago,NaN,USA,14.331023,-170.710526
3361,GAM,Gambell,Gambell,AK,USA,63.766766,-171.732824
3362,AKA,Atka,Atka,AK,USA,52.220348,-174.206350
3363,ADK,Adak,Adak,AK,USA,51.877964,-176.646031

7.) The goal is to find the airport with the lowest latitude in Wisconsin. However, the dataset in airports_unclean.csv is unclean, which has generated some questions on the data gathering processes.

For most rows in this dataset the state column is a two-letter upper case abbreviation of the state name (e.g., CO for Colorado).

This is true for the vast majority of airports in the dataset. However, it is not true for some airports. The state column has been corrupted in two ways:

The state abbreviation could be corrupted. This happens especially in the state of Wisconsin (e.g., in one case "wisconsin" got written instead of "WI").
The state value could be missing.
Additionally, some of the names and cities are missing too.

Ignore the airports with missing state values. What is the latitude of the airport with the lowest latitude in Wisconsin? 

Hint 1: all variations on the spelling of "Wisconsin" start with "w" and "i" but may have different case.

Hint 2: To check if a string starts with variants of "wi" i.e. "wi/WI/Wi/wI", one can simply convert it to lowercase using a method like string .lower() and compare the first two characters to "wi".

NOTE: Report your result rounded to 2 places after the decimal.

In [15]:
clean_df_airports = df_airports.dropna(subset=['state'])
clean_df_airports['state'] = clean_df_airports['state'].astype(str).str.lower()
wisc_airports = clean_df_airports[clean_df_airports['state'].str.startswith('wi')]
lowest_lat = wisc_airports['latitude'].min()
round(lowest_lat, 2)

C:\Users\phill\AppData\Local\Temp\ipykernel_42144\1351255004.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_df_airports['state'] = clean_df_airports['state'].astype(str).str.lower()

42.6

---
**Problem 8.**

In [16]:
df_flights = pd.read_csv("flights_unclean.csv")
df_flights

                 date  delay destination  distance  Distance origin
0      2/3/2001 20:50     -2         RDU     443.0       NaN    BNA
1      2/7/2001 21:45     -1         LAS       NaN     223.0    BUR
2     2/10/2001 12:10     -6         LAS       NaN    1235.0    HOU
3     1/25/2001 11:50      8         MSY       NaN     487.0    TPA
4      2/1/2001 08:00     -8         LAX       NaN     337.0    OAK
...               ...    ...         ...       ...       ...    ...
9995  1/12/2001 06:30     -7         HOU       NaN     148.0    AUS
9996  2/17/2001 14:35     -6         STL       NaN     237.0    MCI
9997  2/26/2001 22:29      7         FLL       NaN     197.0    TPA
9998  1/30/2001 21:30     -5         SFO     447.0       NaN    SAN
9999  2/19/2001 20:14     21         SEA     697.0       NaN    SJC

[10000 rows x 6 columns]

8.) A dataset "flights_unclean.csv" contains information about flight travel. However, airports have reported distance information with one of two names – "distance" or "Distance", but not both. What is the mean distance traveled by all flights?

Hint: fillna() 

NOTE: Report your result rounded to 2 places after the decimal.

In [17]:
filled_df_flights = df_flights['distance'].fillna(df_flights['Distance'])
round(filled_df_flights.mean(), 2)

501.34

In [18]:
print(df_flights[['distance', 'Distance']].count())

both_columns = df_flights[df_flights['distance'].notna() & df_flights['Distance'].notna()]
print(f"Flights with values in both columns: {len(both_columns)}")

no_distance = df_flights[df_flights['distance'].isna() & df_flights['Distance'].isna()]
print(f"Flights with no distance value: {len(no_distance)}")

distance    3504
Distance    6496
dtype: int64
Flights with values in both columns: 0
Flights with no distance value: 0

---